# Ultralytics YOLO 🚀, AGPL-3.0 license
# Cell YOLO11-seg Mamba(CYM) segmentation model

# Parameters
nc: 1 # number of classes
scale: l
scales: # model compound scaling constants, i.e. 'model=yolo11n-seg.yaml' will call yolo11-seg.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 355 layers, 2876848 parameters, 2876832 gradients, 10.5 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 355 layers, 10113248 parameters, 10113232 gradients, 35.8 GFLOPs
  m: [0.50, 1.00, 512] # summary: 445 layers, 22420896 parameters, 22420880 gradients, 123.9 GFLOPs
  l: [1.00, 1.00, 512] # summary: 667 layers, 27678368 parameters, 27678352 gradients, 143.0 GFLOPs
  x: [1.00, 1.50, 512] # summary: 667 layers, 62142656 parameters, 62142640 gradients, 320.2 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args] # layer (when input is 256*256*3 the output size)
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2 (128, 128, 64) 
  # - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4 (64, 64, 128)
  - [-1, 1, LDConv, [128, 6, 2]]  # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2 (64, 64, 256)
  # - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8 (32, 32, 256)
  - [-1, 1, LDConv, [256, 6, 2]]  # 3-P3/8
  - [-1, 2, C3k2, [512, True, 0.25]] # 4 (32, 32, 512)
  # - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16 (16, 16, 512) ! too big
  - [-1, 1, LDConv, [512, 6, 2]]  # 5-P4/16
  # - [-1, 2, C3k2, [512, True]] # 6 (16, 16, 512)
  - [-1, 1, H_SS2D, [512, 2, None, 1/3]] # 
  # - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32 (8, 8, 512) ! too big
  - [-1, 1, LDConv, [512, 6, 2]]  # 7-P5/32
  # - [-1, 2, C3k2, [1024, True]] # 8 (8, 8, 512)
  - [-1, 1, H_SS2D, [512, 3, None, 1/3]] # 4
  - [-1, 1, SPPF, [1024, 5]] # 9 (8, 8, 512)
  - [-1, 2, C2PSA, [1024]] # 10 (8, 8, 512)

#   0                  -1  1      1856  ultralytics.nn.modules.conv.Conv             [3, 64, 3, 2]                 
#   1                  -1  1     73984  ultralytics.nn.modules.conv.Conv             [64, 128, 3, 2]               
#   2                  -1  2    173824  ultralytics.nn.modules.block.C3k2            [128, 256, 2, True, 0.25]     
#   3                  -1  1    590336  ultralytics.nn.modules.conv.Conv             [256, 256, 3, 2]              
#   4                  -1  2    691712  ultralytics.nn.modules.block.C3k2            [256, 512, 2, True, 0.25]     
#   5                  -1  1   2360320  ultralytics.nn.modules.conv.Conv             [512, 512, 3, 2]              
#   6                  -1  2   2234368  ultralytics.nn.modules.block.C3k2            [512, 512, 2, True]           
#   7                  -1  1   2360320  ultralytics.nn.modules.conv.Conv             [512, 512, 3, 2]              
#   8                  -1  2   2234368  ultralytics.nn.modules.block.C3k2            [512, 512, 2, True]           
#   9                  -1  1    656896  ultralytics.nn.modules.block.SPPF            [512, 512, 5]                 
#  10                  -1  2   1455616  ultralytics.nn.modules.block.C2PSA           [512, 512, 2] 

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11 (16, 16, 512)
  - [[-1, 6], 1, Concat, [1]] # 12 cat backbone P4
  # - [[4, 6, -1], 1, TFE, [512]] # cat backbone P4 ->11 bigest!!!!
  - [-1, 2, C3k2, [512, False]] # 13

  # - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  # - [[-1, 4], 1, Concat, [1]] # 14 cat backbone P3
  # - [-1, 1, Conv, [512, 3, 2]] # ->13 cat backbone P3 ->13
  - [[2, 4, -1], 1, TFE, [256]] # cat backbone P3 ->14
  - [-1, 2, C3k2, [256, False]] # 15 (P3/8-small)

  # - [-1, 1, H_SS2D, [256, 2, None, 1/3]] # 15
  - [-1, 1, Conv, [256, 3, 2]] # 16
  - [[-1, 13], 1, Concat, [1]] # 17 cat head P4
  - [-1, 2, C3k2, [512, False]] # 18 (P4/16-medium)

  # - [-1, 1, H_SS2D, [512, 3, None, 1/3]] # 19
  - [-1, 1, Conv, [512, 3, 2]] # 19
  - [[-1, 10], 1, Concat, [1]] # 20 cat head P5
  - [-1, 2, C3k2, [1024, True]] # 21 (P5/32-large)

  - [[10, -1], 1, CPAM, [512]] # ->22

  - [[15, 18, 22], 1, Segment, [nc, 32, 256]] # Detect(P3, P4, P5)


#  11          [4, 6, -1]  1  14160896  ultralytics.nn.modules.improve.TFE           [512]                         
#  12                  -1  2   2758656  ultralytics.nn.modules.block.C3k2            [1536, 512, 2, True]          
#  13          [2, 4, -1]  1   3541504  ultralytics.nn.modules.improve.TFE           [256]                         
#  14                  -1  2    822272  ultralytics.nn.modules.block.C3k2            [1280, 256, 2, True]          
# [H_SS2D] 2 order with dims= [128, 256] scale=0.3333
#  15                  -1  1    985856  ultralytics.nn.modules.Mamba.custom.H_SS2D   [256, 2, None, '1/3']         
#  16                  -1  1    590336  ultralytics.nn.modules.conv.Conv             [256, 256, 3, 2]              
#  17            [-1, 12]  1         0  ultralytics.nn.modules.conv.Concat           [1]                           
#  18                  -1  2   2365440  ultralytics.nn.modules.block.C3k2            [768, 512, 2, True]           
# [H_SS2D] 3 order with dims= [128, 256, 512] scale=0.3333
#  19                  -1  1   3785728  ultralytics.nn.modules.Mamba.custom.H_SS2D   [512, 3, None, '1/3']         
#  20                  -1  1   2360320  ultralytics.nn.modules.conv.Conv             [512, 512, 3, 2]              
#  21            [-1, 10]  1         0  ultralytics.nn.modules.conv.Concat           [1]                           
#  22                  -1  2   2496512  ultralytics.nn.modules.block.C3k2            [1024, 512, 2, True]          
#  23            [10, -1]  1     49221  ultralytics.nn.modules.improve.CPAM          [512]                         
#  24        [14, 18, 23]  1   3718003  ultralytics.nn.modules.head.Segment          [1, 32, 256, [256, 512, 512]] 
